# Задание №1
# Создать вектор (одномерный массив) размера 10, заполненный нулями
array_out = [0, 0, 0, 0, 0, 0, 0, 0, 0, 0]

# Задание №2
# Создать вектор размера 10, заполненный числом 2.5
array_out = [2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5, 2.5]

# Задание №3
# Создать матрицу (двумерный массив) 3x3 со значениями от 0 до 8
array_out = [[0, 1, 2], [3, 4, 5], [6, 7, 8]]

# Задание №4
# Создать массив 10x10 со случайными значениями, найти минимум и максимум
max = 0.9995184590167224
min = 0.0009728458890668756

# Задание №5
# Создать матрицу (двумерный массив) 3x3 со значениями от 0 до 8
mean = 0.4119689092218053

# Задание №6
# Перемножить матрицы 5x3 и 3x2
result = [[3., 3.], [3., 3.], [3., 3.], [3., 3.], [3., 3.]]

# Задание №7
# Проверить, одинаковы ли 2 numpy массива
# Результат:
# Первый массив:  [1 0 0 1 1]
# Второй массив:  [1 0 0 0 0]
# Равенство:  False

# Задание №8
# Заменить максимальный элемент на ноль
# Результат:
# Начальный массив:  [0.77808537 0.19878751 0.94200685 0.08011008 0.19315778 0.69690442
#                     0.00667726 0.34009553 0.02455722 0.4691543 ]
# Полученный масиив [0.77808537 0.19878751 0.         0.08011008 0.19315778 0.69690442
# 0.00667726 0.34009553 0.02455722 0.4691543 ]

# Задание №9
# Найти ближайшее к заданному значению число в заданном массиве
# Результат:
# Начальный массив:  [ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
#                      24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47
#                      48 49 50 51 52 53 54 55 56 57 58 59 60 61 62 63 64 65 66 67 68 69 70 71
#                      72 73 74 75 76 77 78 79 80 81 82 83 84 85 86 87 88 89 90 91 92 93 94 95
#                      96 97 98 99]
# Искомое число:  75.72104025469217
# Полученное значение:  76

# Задание №10
# Случайно расположить p элементов в 2D массив
# Результат:
# Начальный массив:  [[0. 0. 0.] [0. 0. 0.] [0. 0. 0.]]
# Полученный массив:  [[0. 0. 0.] [0. 0. 1.] [1. 1. 0.]]