# Задание №1
# Представьте список в обратном порядке.
list_in = [2, 4, 8] # Входной список
list_out = [8, 4, 2] # Выходной интервал


# Задание №2
# Представьте список в обратном порядке.
list_in = ["Егор", "", "Гена", "Валера", "", "Митя"] # Входной список
list_out = ["Егор", "Гена", "Валера", "Митя"] # Выходной список

# Задание №3
# Поменять первый и последний элементы списка.
list_in = [1, 2] # Входной список
list_out = [2, 1] # Выходной список

list_in = [1, 2, 3, 4] # Входной список
list_out = [4, 2, 3, 1] # Выходной список

# Задание №4
# Дан список чисел, необходимо первратить его в новый список с квадратами этих чисел.
list_in = [1, 2, 3, 4, 5, 6, 7] # Входной список
list_out = [1, 4, 9, 16, 25, 36, 49] # Выходной список

# Задание №5
# Отсортировать список чисел по убыванию.
list_in = [1, 2, 3, 4, 5, 6, 7] # Входной список
list_out = [7, 6, 5, 4, 3, 2, 1] # Выходной список
