# Задание №1
# Объединить два словаря.
dictionary_1 = {'1': 'a', '2': 'b'}
dictionary_2 = {'3': 'c', '4': 'd'}
dictionary_out = {'1': 'a', '2': 'b', '3': 'c', '4': 'd'}

# Задание №2
# Написать метод, который создает словарь, в котором ключами будут числа между теми, которые передали в метод,
# а значениями эти же числа, возведенные в квадрат.
create_dict(1,10)
dictionary_out = {1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64, 9: 81, 10: 100}

# Задание №3
# Поменять первый и последний элементы списка.
list_in = [1, 2] # Входной список
list_out = [2, 1] # Выходной список

list_in = [1, 2, 3, 4] # Входной список
list_out = [4, 2, 3, 1] # Выходной список

# Задание №4
# Дан список чисел, необходимо первратить его в новый список с квадратами этих чисел.
list_in = [1, 2, 3, 4, 5, 6, 7] # Входной список
list_out = [1, 4, 9, 16, 25, 36, 49] # Выходной список

# Задание №5
# Отсортировать список чисел по убыванию.
list_in = [1, 2, 3, 4, 5, 6, 7] # Входной список
list_out = [1, 4, 9, 16, 25, 36, 49] # Выходной список
