# Задание №1
# Написать метод на вход которого поступает строка, а возвращает массив с символами
to_list('Hello world!')
list_out = [72, 101, 108, 108, 111, 32, 119, 111, 114, 108, 100, 33]

# Задание №2
# Написать метод шифр Цезаря, который на вход получает строку и сдвигает все символы на 1
cipher('Hello world!')
text_out = 'Ifmmp!xpsme"'

# Задание №3
# Написать метод, который находит самую длинную строку
big_text('123', '1234', '1')
text_out = '1234'

# Задание №4
# Написать метод, который находит самый маленький квадрат среди списка чисел
small_number([100, 22, 33, 45])
small_number = 22

# Задание №5
# Написать метод, который получает на вход список чисел и суммирует все числа кроме максимального и минимального значения
sum_of_big_and_small([1, 66, 99, 32])
sum_of_big_and_small = 100